# Текст першого студента
text = """
C++ — це мова програмування загального призначення, яка поєднує процедурне, об'єктно-орієнтоване та шаблонне програмування. 
Вона є розширенням мови C і пропонує розширені можливості для управління пам'яттю, що робить її популярною в розробці системного програмного забезпечення, ігор та додатків з високими вимогами до продуктивності. 
Завдяки концепціям, таким як класи, спадкування та поліморфізм, C++ дозволяє створювати складні програми з можливістю повторного використання коду. 
Хоча синтаксис може бути складнішим, ніж у деяких сучасних мов, C++ забезпечує високий рівень контролю та ефективності.
"""

# Марюха Дар'я (lower(), rstrip(), isalnum())
low = text.lower()  # Перетворення всього тексту на нижній регістр
enddel = text.rstrip()  # Видалення пробілів в кінці рядка

# Перевіряємо кожне слово, чи складається лише з цифр або літер
words = text.split()
find = all(word.isalnum() for word in words)  # Використовуємо split для поділу на слова

print("Текст після перетворення всього на нижній регістр:\n", low)
print("Текст після видалення символів пробілів в кінці рядка:\n", enddel)
print("Чи всі слова складаються лише з цифр або літер:", find)